## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.orchestrator_sqs_trigger is tainted, so must be replaced
-/+ resource "aws_lambda_event_source_mapping" "orchestrator_sqs_trigger" {
      ~ arn                                = "arn:aws:lambda:us-east-1:886360753244:event-source-mapping:143b3057-3e48-4e4d-a987-32fa79268853" -> (known after apply)
      - bisect_batch_on_function_error     = false -> null
      ~ function_arn                       = "arn:aws:lambda:us-east-1:886360753244:function:aws-java-orchestrator" -> (known after apply)
      - function_response_types            = [] -> null
      ~ id                                 = "143b3057-3e48-4e4d-a987-32fa79268853" -> (known after apply)
      ~ last_modified                      = "2026-01-11T11:12:57Z" -> (known after apply)
      + last_processing_result             = (known after apply)
      - maximum_batching_window_in_seconds = 0 -> null
      ~ maximum_record_age_in_seconds      = 0 -> (known after apply)
      ~ maximum_retry_attempts             = 0 -> (known after apply)
      ~ parallelization_factor             = 0 -> (known after apply)
      - queues                             = [] -> null
      ~ state                              = "Enabled" -> (known after apply)
      ~ state_transition_reason            = "USER_INITIATED" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      - topics                             = [] -> null
      - tumbling_window_in_seconds         = 0 -> null
      ~ uuid                               = "143b3057-3e48-4e4d-a987-32fa79268853" -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ amazon_managed_kafka_event_source_config {
          + arn                                = (known after apply)
          + batch_size                         = (known after apply)
          + bisect_batch_on_function_error     = (known after apply)
          + enabled                            = (known after apply)
          + event_source_arn                   = (known after apply)
          + function_arn                       = (known after apply)
          + function_name                      = (known after apply)
          + function_response_types            = (known after apply)
          + id                                 = (known after apply)
          + kms_key_arn                        = (known after apply)
          + last_modified                      = (known after apply)
          + last_processing_result             = (known after apply)
          + maximum_batching_window_in_seconds = (known after apply)
          + maximum_record_age_in_seconds      = (known after apply)
          + maximum_retry_attempts             = (known after apply)
          + parallelization_factor             = (known after apply)
          + queues                             = (known after apply)
          + region                             = (known after apply)
          + starting_position                  = (known after apply)
          + starting_position_timestamp        = (known after apply)
          + state                              = (known after apply)
          + state_transition_reason            = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + topics                             = (known after apply)
          + tumbling_window_in_seconds         = (known after apply)
          + uuid                               = (known after apply)
        } -> (known after apply)

      ~ self_managed_kafka_event_source_config {
          + arn                                = (known after apply)
          + batch_size                         = (known after apply)
          + bisect_batch_on_function_error     = (known after apply)
          + enabled                            = (known after apply)
          + event_source_arn                   = (known after apply)
          + function_arn                       = (known after apply)
          + function_name                      = (known after apply)
          + function_response_types            = (known after apply)
          + id                                 = (known after apply)
          + kms_key_arn                        = (known after apply)
          + last_modified                      = (known after apply)
          + last_processing_result             = (known after apply)
          + maximum_batching_window_in_seconds = (known after apply)
          + maximum_record_age_in_seconds      = (known after apply)
          + maximum_retry_attempts             = (known after apply)
          + parallelization_factor             = (known after apply)
          + queues                             = (known after apply)
          + region                             = (known after apply)
          + starting_position                  = (known after apply)
          + starting_position_timestamp        = (known after apply)
          + state                              = (known after apply)
          + state_transition_reason            = (known after apply)
          + tags                               = (known after apply)
          + tags_all                           = (known after apply)
          + topics                             = (known after apply)
          + tumbling_window_in_seconds         = (known after apply)
          + uuid                               = (known after apply)
        } -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>